/**
 * 표준코드에 대한 설명은 아래 링크를 참고
 * https://developer.mozilla.org/en-US/docs/Web/HTTP/Status
 */
export const HTTP_CODE = {
  OK: 200,
  CREATED: 201,
  NO_CONTENT: 204,
  // 응답 상태 코드는 서버가 클라이언트 오류
  // (예: 잘못된 요청 구문, 유효하지 않은 요청 메시지 프레이밍, 또는 변조된 요청 라우팅)를
  // 감지해 요청을 처리할 수 없거나, 하지 않는다는 것을 의미합니다.
  BAD_REQUEST: 400,
  UNAUTHORIZED: 401, // 로그인이 되지 않아 접근이 불가함을 의미
  FORBIDDEN: 403, // 로그인이 되었으나 해당 리소스에 대해 권한이 없음을 의미. 즉 logic단에서 권한이나 역할에 따라 블락당한 경우
  NOT_FOUND: 404, // 요청한 리소스를 찾을 수 없음. 리소스가 삭제된경우 410을 사용하기를 권장하나, 우리 앱에서는 404를 공통으로 쓰도록 한다.
  UNPROCESSABLE_ENTITY: 422 // 이 응답은 서버가 요청을 이해하고 요청 문법도 올바르지만 요청된 지시를 따를 수 없음을 나타냅니다.
};
